

class TelegramFmtTexts():
    def __init__(self):
        self.start = "<b>Всего три простых шага!</b>\n\n1) Пополняй свой аккаунт Good Game в любом из наших киберспортивных клубов от 250 ₽ за 24 суммарно\n2) Нажми на кнопку  \"Открыть кейс\" \n3) Выигрывай призы!\n\nВсе призы можно получить у администратора.\nПодробнее о всех призах в разделе \"🎁 Призы 🎁\""
        self.getPresentsList = "<b>Ваши призы:</b>\n\n"
        self.present_success = "Поздравляем, вы получаете:"
        self.present_failure_amount = "Нужно пополниться чтобы получить подарок"
        self.present_failure_limit_exceeded = "Вы уже получили три приза. Попробуйте завтра"
        self.choose_category = "Выберите категорию\n\n"
        self.getPresentsAll = "Призы из Кейсов можно забрать сразу у администратора.\nДля этого необходимо подойти к администратору и, открыв вкладку \"Мои подарки\", показать список призов, которые у тебя сейчас есть.\
\n\
\n\
<b>Базовый Кейс (250₽)</b>\n\
1 час игры за пк\n\
Полчаса игры за PS\n\
Полчаса игры за ПК\n\
\n\
<b>Кейс для бояр (500₽)</b>\n\
Батончик\n\
1.5 часа за PC\n\
Кола (0.5)\n\
Пакет в зал Стандарт (ночной)\n\
\n\
<b>Кейс для Вельмож (1000₽)</b>\n\
Пакет в зал VIP (утренний)\n\
Кола и батончик\n\
3 часа за PS\n\
\n\
<b>Кейс для Меценатов (2000₽)</b>\n\
Абонемент на посещение клуба (на все выходные)\n\
Кальян\n\
Пакет в зал VIP (ночной)"

    def fmt(self, data):
        if 'text' in data:
            text = data['text']

            if text['from'] == 'getCategories':
                if text['data']['exceeded'] == True:
                    return self.present_failure_limit_exceeded
                elif not text['data']['available_categories']:                                                                            return self.present_failure_amount
                else:
                    return self.choose_category

            elif text['from'] == 'getPresentsList':
                res = ""
                for row in text['data']:
                    res += row['present_in_category'] + '\n'
                return self.getPresentsList + res
                
            elif text['from'] == 'getPresent':
                return self.present_success + text['data']['present_in_category']

